#include "structure.h"

#define player_number 20

//player_his player_history_list[player_number] = {
//{ "0_1", 1,2,0,0,'Y'},
//{ "0_2", 1,0,0,0,'Y'},
//{ "0_3", 0,4,0,0,'Y'},
//{ "0_4", 1,0,2,0,'Y'},
//
//{ "1_5", 3,0,0,1,'Y'},
//{ "1_6", 2,4,0,0,'Y'},
//{ "1_7", 1,3,1,0,'Y'},
//{ "1_8", 1,2,0,0,'Y'},
//
//{ "2_9", 3,0,0,1,'Y'},
//{ "2_10", 0,1,0,0,'Y'},
//{ "2_11", 0,3,1,0,'Y'},
//{ "2_12", 3,5,1,0,'Y'}
//};

player player_list[player_number] = {
	{"0_1", "김태연", 160, 45, 1, "GK", 'Y'},
	{"0_2", "티파니", 161, 45, 2, "DF", 'Y'},
	{"0_3", "최수영", 170, 45, 3, "MF", 'Y'},
	{"0_4", "서주현", 163, 45, 4, "FW", 'Y'},
	{"1_5", "임윤아", 164, 45, 5, "GK", 'Y'},
	{"1_6", "김효연", 165, 45, 6, "DF", 'Y'},
	{"1_7", "이순규", 166, 45, 7, "MF", 'Y'},
	{"1_8", "권유리", 167, 45, 8, "FW", 'Y'},
	{"2_9", "카리나", 168, 45, 9, "GK", 'Y'},
	{"2_10", "닝닝", 169, 45, 10, "DF", 'Y'},
	{"2_11", "윈터", 170, 45, 11, "MF", 'Y'},
	{"2_12", "지젤", 171, 45, 12, "FW", 'Y'}
};

teamProfile team_list[10] =
{
	{ 0,"울산광역시","문수월드컵경기장",1983,"홍명보",2,"울산현대호랑이축구단",'Y'},
	{ 1,"부산광역시","부산아시아드주경기장",1979,"히카르두페레즈",4,"부산아이파크축구단",'Y'},
	{ 2,"제주특별자치도","제주월드컵경기장",1982,"남기일",1,"제주유나이티즈FC",'Y'}
};

//team_hist team_hist_list[100] = {
//	{2021, 2, 24, "부산아이파크축구단", "울산현대호랑이축구단", 3, 2, 'y'},
//	{2021, 5, 11, "부산아이파크축구단", "제주유나이티즈FC", 4, 5, 'y'},
//	{2021, 5, 11, "울산현대호랑이축구단", "제주유나이티즈FC", 2, 1, 'y'},
//};

team_match team_match_list[10] = {
	{'0', 0, 0, 0}
};